
問題.1
以下の情報を「クラスで定義すべき情報」と「インスタンスで定義すべき情報」に分けてください。

動物という概念
山田太郎さんという会員
レシピ投稿サービスに投稿した、オムレツのレシピ
回答
1
解答を貼り付けてください。
1
# コードブロックは上のように```の直後に言語名を指定してください。
模範解答
解答
クラスで定義すべき情報
1（動物という概念）

インスタンスで定義すべき情報
2と3（山田太郎さんという会員とレシピ投稿サービスに投稿したオムレツのレシピ）

解説
インスタンスが具体的な個別の値(データ)、クラスはそれらの個別の値(データ)を総称する概念を指します。

現実世界で考えると分かりやすいですが、実体として存在しており個性のあるものがインスタンスになります。例えば私たち1人1人はプログラムで表すならインスタンスです。いま使っているパソコンやスマホなどもインスタンスです。目の前に見えるもの全てがインスタンスと言えます。

一方で、私たちは「人間」と総称されます。家にある1つ1つの机や椅子も「家具」と総称されます。そうした総称やひとくくりにまとめた概念をプログラムではクラスと言います。

では、今回の問題の選択肢を1つ1つ見ていきましょう。

1. 動物という概念
これは文字通り概念であるため、クラスとなります。
動物というクラスに対して、インスタンスは誰かの買っているペットや、実際に飛び回っている野生の鳥になります。

2. 山田太郎さんという会員
これは具体的な1人を指すため、インスタンスとなります。
山田太郎さんというインスタンスに対して、クラスは会員という概念になります。

3. レシピ投稿サービスに投稿した、オムレツのレシピ
これは数あるレシピの中でもオムレツという具体的なレシピを指すため、インスタンスとなります。
オムレツのレシピというインスタンスに対して、クラスはレシピという概念になります。

採点方法
完全正答で2点。それ以外は0点。

この回答の点数を入力してください。
0
点配点2点
問題.2
以下の2つの用語について具体的な例を交えながらできるだけ詳細に説明してください。

クラス
インスタンス
回答
1
解答を貼り付けてください。
1
# コードブロックは上のように```の直後に言語名を指定してください。
模範解答
解答
1. クラス
クラスは個別の値(データ)を作るための雛形です。プログラムで使う値は、何らかのクラスから作られています。クラスには値に持たせたい共通の属性やメソッドが定義されています。

例えば「人間」をプログラムで作るとしましょう。人間とは私たち全体を指す総称です。友人や家族を呼ぶときに「人間」と呼ぶ人はいないと思います。人間や動物のような総称や概念をプログラムではクラスと言います。つまり、クラスには実体はありません。

人間にはみんなが共通して持っている特徴があります。例えば名前や性別、住所です。こうした共通の特徴を属性といいます。
また、共通して行うことのできる動作もあります。例えば歩いたり、ものを持つといったことです。こうした共通の動作をメソッドと言います。

クラスにはこのように個々が持つ共通の特徴や動作を、属性とメソッドとして定義してあります。

2. インスタンス
インスタンスはクラスから作られた個別の値(データ)のことです。クラスが定義した共通の属性やメソッドをインスタンスは持っています。

クラスと同様に「人間」の場合で考えてみます。人間という総称や概念がクラスです。一方で、その人間であるあなたや友人、家族、その他すべての人たち1人1人がインスタンスになります。クラスと違ってインスタンスは実体があります。

クラスの持つ属性の具体的な値をインスタンスは持っています。人間で言えば1人1人がそれぞれの名前や住所、性別を持っています。
クラスの持つメソッドもインスタンスであれば実行できます。しかし、メソッドの結果はインスタンスごとに変わります。人間で言えば走ることはみんなできても、そのくらいのスピードで走れるかは1人1人で違うということです。


